In [2]:
import pandas as pd
import numpy as np

In [3]:
dataframe = pd.DataFrame({'Date' : list('123123123123'),'Variable':list('AAABBBCCCDDD'),'Dataset':np.random.randn(12)})

In [4]:
dataframe

   Date Variable   Dataset
0     1        A -1.380370
1     2        A -0.874287
2     3        A  0.684848
3     1        B -1.119359
4     2        B  2.007558
5     3        B -0.255382
6     1        C -0.836633
7     2        C -2.158323
8     3        C  0.954985
9     1        D  0.165939
10    2        D  1.369975
11    3        D -1.270078

### Pivot and Pivot Table.

dataframe.pivot(index,columns,values)  #maching values.

In [5]:
dataframe.pivot('Date','Variable','Dataset')

Variable         A         B         C         D
Date
1        -1.380370 -1.119359 -0.836633  0.165939
2        -0.874287  2.007558 -2.158323  1.369975
3         0.684848 -0.255382  0.954985 -1.270078

#### Pivote Table

In [6]:
import pandas as pd
data = pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],'B':['one','one','two','two','one','one'],'C':list('xyxyxy'),'D':[1,3,2,5,4,1]})

In [7]:
data

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [8]:
data.pivot_table(values=['D'],index=['A','B'],columns=['C'])

           D
C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Duplicates in Dataframe.

In [9]:
dataframe = pd.DataFrame({'Key1':list('AABBB'),'Key2':[2,2,2,3,3]})

In [10]:
dataframe

  Key1  Key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [11]:
dataframe.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [12]:
dataframe['Key1'].duplicated()

0    False
1     True
2    False
3     True
4     True
Name: Key1, dtype: bool

In [13]:
dataframe.drop_duplicates()

  Key1  Key2
0    A     2
2    B     2
3    B     3

In [14]:
dataframe.drop_duplicates(['Key1'])

  Key1  Key2
0    A     2
2    B     2

In [15]:
dataframe.drop_duplicates(['Key1'],keep='last')

  Key1  Key2
1    A     2
4    B     3

In [16]:
highmap = {'Hardik':3,'Asif':3,'Kartik':2,'Rudresh':0}
highmap

{'Hardik': 3, 'Asif': 3, 'Kartik': 2, 'Rudresh': 0}

### Mapping in dataframe.

In [17]:
data1 = pd.DataFrame({'Name':['Hardik','Asif','Kartik','Rudresh'],'Weight':[40,100,300,5]})

In [18]:
data1

      Name  Weight
0   Hardik      40
1     Asif     100
2   Kartik     300
3  Rudresh       5

In [19]:
data1['Height']=data1['Name'].map(highmap)

In [20]:
data1  #unique column

      Name  Weight  Height
0   Hardik      40       3
1     Asif     100       3
2   Kartik     300       2
3  Rudresh       5       0

### Groupby

It is used to split based on some criteria.

In [21]:
import numpy as np

In [22]:
data = pd.DataFrame({'D1':np.random.randn(5),'D2':np.random.randn(5),'K1':list('xxyyz'),'K2':['Alpha','Beta','Alpha','Beta','Alpha']})

In [23]:
data

         D1        D2 K1     K2
0 -0.871537 -1.087510  x  Alpha
1  0.826340  0.531049  x   Beta
2  0.715609  0.785919  y  Alpha
3 -0.554572  1.716725  y   Beta
4 -1.044414 -0.071499  z  Alpha

#### Type 1 :-On the basis on two columns and same datasests.

In [24]:
data['D1'].groupby(data['K1']).mean()

K1
x   -0.022598
y    0.080519
z   -1.044414
Name: D1, dtype: float64

In [25]:
data['D1'].groupby(data['K1']).mean().count()

3

In [26]:
data['D1'].groupby(data['K1']).max()

K1
x    0.826340
y    0.715609
z   -1.044414
Name: D1, dtype: float64

In [27]:
data['D1'].groupby(data['K1']).min()

K1
x   -0.871537
y   -0.554572
z   -1.044414
Name: D1, dtype: float64

#### Type 2:-On the basis of array and Dataframe.

In [28]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [29]:
cities

array(['NY', 'LA', 'LA', 'NY', 'NY'], dtype='<U2')

In [30]:
month

array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'], dtype='<U3')

In [31]:
data['D2'].groupby([cities,month]).count()

LA  FEB    1
    JAN    1
NY  FEB    1
    JAN    2
Name: D2, dtype: int64

In [32]:
data['D2'].groupby([cities,month]).mean()

LA  FEB    0.531049
    JAN    0.785919
NY  FEB    1.716725
    JAN   -0.579504
Name: D2, dtype: float64

In [33]:
data['D2'].groupby([cities,month]).sum()

LA  FEB    0.531049
    JAN    0.785919
NY  FEB    1.716725
    JAN   -1.159009
Name: D2, dtype: float64

#### Type3 :- oN THE BASIS OF One columns and full dataframe.

In [34]:
data.groupby(['K2'])

In [35]:
data.groupby(['K2']).mean()

             D1        D2
K2
Alpha -0.400114 -0.124363
Beta   0.135884  1.123887

In [36]:
data.groupby(['K2']).count()

       D1  D2  K1
K2
Alpha   3   3   3
Beta    2   2   2

#### Type 4:-On the basis of two columns and full dataframe.

In [37]:
data.groupby(['K1','K2'])

In [38]:
data.groupby(['K1','K2']).count()

          D1  D2
K1 K2
x  Alpha   1   1
   Beta    1   1
y  Alpha   1   1
   Beta    1   1
z  Alpha   1   1

In [39]:
data.groupby(['K1','K2']).mean()

                D1        D2
K1 K2
x  Alpha -0.871537 -1.087510
   Beta   0.826340  0.531049
y  Alpha  0.715609  0.785919
   Beta  -0.554572  1.716725
z  Alpha -1.044414 -0.071499

#### Type 5:On the basis on dictionary to the columns of dataframe.

In [40]:
df1 = pd.DataFrame(np.arange(16).reshape(4,4),columns=['W','X','Y','Z'],index=['DOG','CAT','COW','LION'])

In [41]:
df1

       W   X   Y   Z
DOG    0   1   2   3
CAT    4   5   6   7
COW    8   9  10  11
LION  12  13  14  15

In [42]:
dict1 = {'W':'Good','X':'BAD','Y':'GOOD','Z':'BAD'}

In [43]:
dict1

{'W': 'Good', 'X': 'BAD', 'Y': 'GOOD', 'Z': 'BAD'}

In [44]:
df1.groupby(dict1,axis=1)

In [45]:
df1.groupby(dict1,axis=1).count()

      BAD  GOOD  Good
DOG     2     1     1
CAT     2     1     1
COW     2     1     1
LION    2     1     1

In [46]:
df2 = pd.DataFrame(np.arange(16).reshape(4,4),columns=['W','X','Y','Z'],index=['DOG','CAT','COW','LION'])

In [47]:
df2

       W   X   Y   Z
DOG    0   1   2   3
CAT    4   5   6   7
COW    8   9  10  11
LION  12  13  14  15

In [48]:
dict1 = {'W':'Good','X':'BAD','Y':'GOOD','Z':'BAD'}

In [49]:
dict1

{'W': 'Good', 'X': 'BAD', 'Y': 'GOOD', 'Z': 'BAD'}

In [50]:
df2.iloc[1,0]=np.nan

In [51]:
df2

         W   X   Y   Z
DOG    0.0   1   2   3
CAT    NaN   5   6   7
COW    8.0   9  10  11
LION  12.0  13  14  15

#### Type 6:On the basis of function.

In [52]:
df2.groupby(len).sum()

      W   X   Y   Z
3   8.0  15  18  21
4  12.0  13  14  15

#### Type 5:On the basis of function.

In [54]:
df = pd.DataFrame(np.arange(16).reshape(4,4),columns=['W','X','Y','Z'],index=['DOG','CAT','COW','LION'])

In [55]:
dict1 = {'W':'GOOD','X':'BAD','Y':'GOOD','Z':'BAD'}